Repository: LEOYoon-Tsaw/Squirrel-Designer
Catalog: Squirrel Designer/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# %@ %@FOUND_IN%@
source: Error: %1$@ Type “%2$@” found at: %3$@
zh_hans: 出错：%1$@ 类型“%2$@”出现在： %3$@
zh_hant: 出錯：%1$@ 類型「%2$@」出現在： %3$@

# %@ %@KEY_NOT_FOUND_IN%@
source: Error: %1$@ Key “%2$@” is not found at: %3$@
zh_hans: 出错：%1$@ 未找到键“%2$@”： %3$@
zh_hant: 出錯：%1$@ 未找到鍵「%2$@」： %3$@

# %@ IN%@
source: Error: %1$@ Occurred at: %2$@
zh_hans: 出错：%1$@ 位于： %2$@
zh_hant: 出錯：%1$@ 位於： %2$@

# %@ VALUE_OF_TYPE%@NOT_FOUND_IN%@
source: Error: %1$@ Value of type “%2$@” is not found at: %3$@
zh_hans: 出错：%1$@ 未找到“%2$@”类型数㨿： %3$@
zh_hant: 出錯：%1$@ 未找到「%2$@」類型數㨿： %3$@

source: Add Alpha
zh_hans: 指定透明度
zh_hant: 指定透明度

source: Add Author
zh_hans: 添加作者
zh_hant: 添加作者

source: Add Border Color
zh_hans: 指定边框色
zh_hant: 指定邊框色

source: Add Border Height
zh_hans: 指定边框高
zh_hant: 指定邊框高

source: Add Border Width
zh_hans: 指定边框宽
zh_hant: 指定邊框寬

# ADD_CAND_BACK_COLOR
source: Add Candidate Back Color
zh_hans: 指定候选背景色
zh_hant: 指定候選背景色

# ADD_CAND_COMMENT_COLOR
source: Add Candidate Comment Color
zh_hans: 指定注释色
zh_hant: 指定注釋色

# ADD_CAND_LABEL_COLOR
source: Add Candidate Label Color
zh_hans: 指定序号色
zh_hant: 指定序號色

# ADD_CAND_LINESPACE
source: Add Cand. Spacing
zh_hans: 指定候选行距
zh_hant: 指定候選行距

# ADD_CAND_TEXT_COLOR
source: Add Cand. Color
zh_hans: 指定候选色
zh_hant: 指定候選色

# ADD_COMMENT_FONT
source: Add Comment Font Fallback
zh_hans: 添加序号备用字体
zh_hant: 添加序號備用字體

# ADD_COMMENT_FONTS
source: Add Comment Font
zh_hans: 指定注释字体
zh_hant: 指定注釋字體

source: Add Corner Radius
zh_hans: 指定圆角径
zh_hant: 指定圓角徑

source: Add Dark Scheme
zh_hans: 指定暗配色
zh_hant: 指定暗配色

# ADD_FONT
source: Add Font Fallback
zh_hans: 添加备用字体
zh_hant: 添加備用字體

source: Add Font Base Offset
zh_hans: 指定文字基线
zh_hant: 指定文字基線

# ADD_HILIT_CAND_BACK_COLOR
source: Add Selected Cand. Back Color
zh_hans: 指定高亮候选背景色
zh_hant: 指定高亮候選背景色

# ADD_HILIT_CAND_COMMENT_COLOR
source: Add Selected Cand. Comment Color
zh_hans: 指定高亮注释色
zh_hant: 指定高亮注釋色

# ADD_HILIT_CAND_LABEL_COLOR
source: Add Selected Cand. Label Color
zh_hans: 指定高亮序号色
zh_hant: 指定高亮序號色

# ADD_HILIT_CAND_TEXT_COLOR
source: Add Selected Cand. Color
zh_hans: 指定高亮候选色
zh_hant: 指定高亮候選色

# ADD_HILIT_CORNER_RADIUS
source: Add Selection Corner Radius
zh_hans: 指定高亮圆角径
zh_hant: 指定高亮圓角徑

# ADD_HILIT_PREEDIT_BACK_COLOR
source: Add Selected Preedit Back Color
zh_hans: 指定编辑区高亮背景色
zh_hant: 指定編輯區高亮背景色

# ADD_HILIT_TEXT_COLOR
source: Add Selected Preedit Color
zh_hans: 指定编辑区高亮色
zh_hant: 指定編輯區高亮色

# ADD_IS_MUTUAL_EXCLUSIVE
source: Add Non-Stacking Colors Toggle
zh_hans: 添加颜色叠加开关
zh_hant: 添加顏色疊加開關

source: Add Item
zh_hans: 添加
zh_hant: 添加

# ADD_LABEL_FONT
source: Add Label Font Fallback
zh_hans: 添加序号备用字体
zh_hant: 添加序號備用字體

# ADD_LABEL_FONTS
source: Add Label Font
zh_hans: 指定序号字体
zh_hant: 指定序號字體

# ADD_LINEAR
source: Add Linear Toggle
zh_hans: 指定候选排布
zh_hant: 指定候選排布

source: Add Preedit Back Color
zh_hans: 指定编辑区背景色
zh_hant: 指定編輯區背景色

# ADD_PREEDIT_LINESPACE
source: Add Preedit Spacing
zh_hans: 指定编辑区间隔
zh_hant: 指定編輯區間隔

source: Add Readable Name
zh_hans: 添加可读名
zh_hant: 添加可讀名

source: Add Shadow Size
zh_hans: 指定阴影尺寸
zh_hant: 指定陰影尺寸

# ADD_SUR_EXTRA_EXPAN
source: Add Cand. Back Size Offset
zh_hans: 指定候选项尺寸微调量
zh_hant: 指定候選項尺寸微調量

# ADD_TRANSLUCENT
source: Add Translucency Toggle
zh_hans: 添加毛玻璃开关
zh_hant: 添加毛玻璃開關

# ADD_VERTICAL
source: Add Vertical Toggle
zh_hans: 指定文字方向
zh_hant: 指定文字方向

# ALL_CODE
source: Full Code
zh_hans: 全局代码
zh_hant: 全局代碼

source: Alpha
zh_hans: 透明度
zh_hant: 透明度

# BACKGROUND_COLOR
source: Panel Color
zh_hans: 背景色
zh_hant: 背景色

source: Background Colors
zh_hans: 背景色
zh_hant: 背景色

source: Border Color
zh_hans: 边框色
zh_hant: 邊框色

source: Border Height
zh_hans: 边框高
zh_hant: 邊框高

source: Border Width
zh_hans: 边框宽
zh_hant: 邊框寬

# CAND
source: Text
zh_hans: 候选
zh_hant: 候選

source: Cand. Back Color
zh_hans: 候选背景色
zh_hant: 候選背景色

source: Cand. Comment Color
zh_hans: 注释色
zh_hant: 注釋色

source: Cand. Format
zh_hans: 候选格式
zh_hant: 候選格式

# CAND_FORMAT_TIP
source: Allowed placeholders in candidate format are:
zh_hans: 可用这些代号调整候选格式：
zh_hant: 可用這些代號調整候選格式：

source: Cand. Label Color
zh_hans: 序号色
zh_hant: 序號色

# CAND_LINESPACE
source: Cand. Spacing
zh_hans: 候选行距
zh_hant: 候選行距

# CAND_TEXT_COLOR
source: Cand. Color
zh_hans: 候选文字色
zh_hant: 候選文字色

source: Candidates
zh_hans: 候选
zh_hant: 候選

source: Code
zh_hans: 代码
zh_hant: 代碼

source: Color Scheme: %@
zh_hans: 配色：%@
zh_hant: 配色：%@

source: Color Schemes
zh_hans: 配色方案
zh_hant: 配色方案

source: Color Space
zh_hans: 色空间
zh_hant: 色空間

source: Comment
zh_hans: 注释
zh_hant: 注釋

source: Comment Font
zh_hans: 注释字体
zh_hant: 注釋字體

source: Corner Radius
zh_hans: 圆角径
zh_hant: 圓角徑

source: Dark Scheme
zh_hans: 暗配色
zh_hant: 暗配色

source: Delete
zh_hans: 删除
zh_hant: 刪除

# DELETE_ROW
source: Delete
zh_hans: 删除
zh_hant: 刪除

source: Done
zh_hans: 毕
zh_hant: 畢

source: Duplicate
zh_hans: 复制
zh_hant: 複製

source: Edit
zh_hans: 编辑
zh_hant: 編輯

# EMPTY_NAME_ERROR
source: New name cannot be empty
zh_hans: 新名不得为空
zh_hant: 新名不得爲空

source: Error
zh_hans: 错误
zh_hant: 錯誤

source: Font
zh_hans: 字体
zh_hant: 字體

source: Font Base Offset
zh_hans: 字体基线
zh_hant: 字體基線

# FONT_NAME
source: Family
zh_hans: 字族
zh_hant: 字族

# FONT_SIZE
source: Size
zh_hans: 字号
zh_hant: 字號

# FONT_WEIGHT
source: Weight
zh_hans: 字重
zh_hant: 字重

source: Fonts
zh_hans: 字体
zh_hant: 字體

# HILIT_CAND_BACK_COLOR
source: Selected Cand. Back Color
zh_hans: 高亮候选背景色
zh_hant: 高亮候選背景色

# HILIT_CAND_COMMENT_COLOR
source: Selected Cand. Comment Color
zh_hans: 高亮候选注释色
zh_hant: 高亮候選注釋色

# HILIT_CAND_LABEL_COLOR
source: Selected Cand. Label Color
zh_hans: 高亮候选序号色
zh_hant: 高亮候選序號色

# HILIT_CAND_TEXT_COLOR
source: Selected Cand. Color
zh_hans: 高亮候选色
zh_hant: 高亮候選色

# HILIT_CORNER_RADIUS
source: Selection Corner Radius
zh_hans: 高亮候选圆角径
zh_hant: 高亮候選圓角徑

# HILIT_PREEDIT_BACK_COLOR
source: Selected Preedit Back Color
zh_hans: 编辑区高亮背景色
zh_hant: 編輯區高亮背景色

# HILIT_TEXT_COLOR
source: Selected Preedit Color
zh_hans: 编辑区高亮色
zh_hant: 編輯區高亮色

# IS_INLINE_CAND
source: Inline Candidate
zh_hans: 内置候选
zh_hant: 內置候選

# IS_INLINE_PREEDIT
source: Inline Preedit
zh_hans: 内置编辑区
zh_hant: 內置編輯區

# IS_LINEAR
source: Linear Layout
zh_hans: 展列式候选
zh_hant: 展列式候選

# IS_MEMORIZING_SIZE
source: Sticky Panel Size
zh_hans: 黏性候选框
zh_hant: 黏性候選框

# IS_MUTUAL_EXCLUSIVE
source: Non-Stacking Colors
zh_hans: 颜色不叠加
zh_hant: 顏色不疊加

# IS_SHOWING_PAGING
source: Show Paging
zh_hans: 翻䈎键
zh_hant: 翻䈎鍵

# IS_TRANSLUCENT
source: Translucent
zh_hans: 毛玻璃
zh_hant: 毛玻璃

# IS_VERTICAL
source: Vertical Text
zh_hans: 竖排文字
zh_hant: 豎排文字

source: Label
zh_hans: 序号
zh_hant: 序號

source: Label Font
zh_hans: 序号字体
zh_hant: 序號字體

source: Metadata
zh_hans: 元数据
zh_hant: 元數據

# NAME_DUP_ERROR_NAME%@
source: “%@” already exists, please choose another name
zh_hans: “%@”已存在，请另择他名
zh_hant: 「%@」已存在，請另擇他名

# NEW_AUTHOR
source: Author Name
zh_hans: 作者
zh_hant: 作者

# NEW_NAME
source: Scheme Name
zh_hans: 配色名
zh_hant: 配色名

source: New Name
zh_hans: 新名
zh_hant: 新名

# NO_ROW
source: No Content
zh_hans: 空白
zh_hant: 空白

# NUMERICS
source: Numeric Settings
zh_hans: 数值项
zh_hant: 數值項

source: Ok
zh_hans: 阅
zh_hant: 閱

# OPTIONAL_VALUES
source: Optional
zh_hans: 可选项
zh_hant: 可選項

source: Preedit
zh_hans: 编辑区
zh_hant: 編輯區

# PREEDIT_AFTER_HILIT
source: Preedit Text After Selection
zh_hans: 高亮后
zh_hant: 高亮後

source: Preedit Back Color
zh_hans: 编辑区背景色
zh_hant: 編輯區背景色

# PREEDIT_BEFORE_HILIT
source: Preedit Text Before Selection
zh_hans: 高亮前
zh_hant: 高亮前

# PREEDIT_HILIT
source: Selected Preedit
zh_hans: 高亮
zh_hant: 高亮

# PREEDIT_LINESPACE
source: Preedit Spacing
zh_hans: 编辑区间隔
zh_hant: 編輯區間隔

source: Preview
zh_hans: 预览
zh_hant: 預覽

source: Redo
zh_hans: 重做
zh_hant: 重做

source: Rename
zh_hans: 改名
zh_hant: 改名

# RESERVED_NAME_ERROR%@
source: “%@” is reserved for special function, please choose another name
zh_hans: “%@”已留作他用，请另择名
zh_hant: 「%@」已留作他用，請另擇名

source: Restore
zh_hans: 复原
zh_hant: 復原

source: Scheme
zh_hans: 配色
zh_hant: 配色

source: Scheme Author
zh_hans: 配色作者
zh_hant: 配色作者

# SCHEME_READABLE_NAME
source: Readable Name
zh_hans: 可读名
zh_hant: 可讀名

source: Schemes
zh_hans: 配色
zh_hant: 配色

source: Selected
zh_hans: 高亮
zh_hant: 高亮

source: Shadow Size
zh_hans: 阴影尺寸
zh_hant: 陰影尺寸

# STATUS_MSG_LONG
source: Long Message
zh_hans: 长消息
zh_hant: 長消息

# STATUS_MSG_MIX
source: Auto
zh_hans: 自动
zh_hant: 自動

# STATUS_MSG_SHORT
source: Short Message
zh_hans: 短消息
zh_hant: 短消息

# STATUS_MSG_TYPE
source: Status Message Format
zh_hans: 状态更新消息格式
zh_hant: 狀態更新消息格式

source: Style
zh_hans: 样式
zh_hant: 樣式

# SUR_EXTRA_EXPAN
source: Cand. Back Size Offset
zh_hans: 候选项尺寸微调量
zh_hant: 候選項尺寸微調量

# SWITCHES
source: Options
zh_hans: 开关
zh_hant: 開關

# TEMPLATE
source: Input Template
zh_hans: 预设输入内容
zh_hant: 預設輸入內容

# TEXT_COLOR
source: Preedit Color
zh_hans: 编辑区文字色
zh_hant: 編輯區文字色

source: Text Colors
zh_hans: 文字色
zh_hant: 文字色

source: Tool
zh_hans: 图形
zh_hant: 圖形

source: Undo
zh_hans: 撤销
zh_hant: 撤銷

source: Unknown Color Space
zh_hans: 未知色空间
zh_hant: 未知色空間

# VIEW_MODE
source: Editing Mode
zh_hans: 编辑模式
zh_hant: 編輯模式
